app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "music_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "First comment"], ["music_id", 19], ["created_at", "2018-04-03 08:05:25.200080"], ["updated_at", "2018-04-03 08:05:25.200080"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 12], ["updated_at", "2018-04-03 08:05:25.227853"], ["id", 2]]
---
    def create
        #Iz forma dobimo podatke in jih shranimo v spremenljivko
        @comment = @music.comments.create(params[:comment].permit(:content))
        @comment.user_id = current_user.id  #V spremenljivko shranimo user_id
        @comment.save   #Shranimo v bazo

UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "Test - successful"], ["updated_at", "2018-04-03 12:27:38.366534"], ["id", 12]]
---
    def update
        #Iz forma dobimo podatke in jih shranimo v comment spremenljivko
        respond_to do |format|
          if @comment.update(params[:comment].permit(:content))

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 7]]
---
    def destroy
        #Comment spremenljivko dobimo iz find_comment funkcije
        @comment.destroy

SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT 1  [["id", nil]]
---
    def find_music
        @music = Music.find(params[:music_id])  #Poiščemo glasbo

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", nil]]
---
    def find_comment
        @comment = Comment.find(params[:id])    #Poiščemo komentar