app/controllers/musics_controller.rb

UPDATE "musics" SET "views" = ?, "user_id" = ?, "updated_at" = ? WHERE "musics"."id" = ?  [["views", 0], ["user_id", 7], ["updated_at", "2018-03-26 07:08:10.450359"], ["id", 13]]
---
    def create
        @music = Music.create(params[:music].permit(:title, :description, :file, :image, :genre_id))
        @music.views = 0
        @music.user_id = current_user.id

        if @music.save