app/controllers/musics_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."music_id" = ?  ORDER BY created_at DESC  [["music_id", 20]]
---
    def show
        #Poiščemo vse komentarje, ki pripadajo glasbi in jih razvrstimo po naraščujočem vrstnem redu
        @comments = Comment.where(music_id: @music.id).order(created_at: :asc)

INSERT INTO "musics" ("title", "description", "file", "genre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "iasodjoi"], ["description", "oiasdjoasidj"], ["file", "GALOZBEJ.mp3"], ["genre_id", 2], ["created_at", "2018-03-20 07:59:04.030261"], ["updated_at", "2018-03-20 07:59:04.030261"]]
---
    def create
        #V spremenjljivko shranimo vse podatke iz forma
        @music = current_user.musics.build(music_params)

        if @music.save

DELETE FROM "musics" WHERE "musics"."id" = ?  [["id", 1]]
---
    def destroy
        @music.destroy  #Iz baze zbrišemo glasbo in smo preusmerjeni na začetno stran

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 8]]
---
    def find_music_user
        @user = User.find(@music.user_id)

SELECT  "musics".* FROM "musics" WHERE "musics"."id" = ? LIMIT 1  [["id", 13]]
---
    def find_music
        @music = Music.find(params[:id])