app/controllers/pages_controller.rb

SELECT "musics".* FROM "musics"
---
    def index
        @music = Music.all