app/views/musics/new.html.erb

SELECT "genres".* FROM "genres"  ORDER BY "genres"."name" ASC
---
    <div class="form-group">
      <%= m.collection_select :genre_id, Genre.order(:name), :id, :name, class: "form-control" %>